{
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_3",
            "layers": [
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense9",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            1
                        ],
                        "dtype": "float32"
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 100,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense10",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 100,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense11",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 100,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense12",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 100,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense13",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense14",
                        "trainable": true
                    }
                }
            ]
        },
        "keras_version": "tfjs-layers 4.19.0",
        "backend": "tensor_flow.js"
    },
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v4.19.0",
    "convertedBy": null,
    "weightsManifest": [
        {
            "paths": [
                "./model-prediction-overfit.weights.bin"
            ],
            "weights": [
                {
                    "name": "dense_Dense9/kernel",
                    "shape": [
                        1,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense9/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense10/kernel",
                    "shape": [
                        1,
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense10/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense11/kernel",
                    "shape": [
                        100,
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense11/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense12/kernel",
                    "shape": [
                        100,
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense12/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense13/kernel",
                    "shape": [
                        100,
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense13/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense14/kernel",
                    "shape": [
                        100,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense14/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}